Autodesk.Revit.DB.IndependentTag.GetTaggedLocalElement
Get the tagged local element if any.
Returns:
The tagged local element, or null for orphan tags and tagged elements in links.

Autodesk.Revit.DB.IndependentTag.CanLeaderEndConditionBeAssigned(Autodesk.Revit.DB.LeaderEndCondition)
Checks whether the LeaderEndCondition can be assigned.
leaderEndCondition:
The leader end condition to check.
Returns:
True if the leader end condition of the tag can be assigned, or false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.IndependentTag.LeaderEndCondition
The leader end condition of the tag.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: LeaderEndCondition cannot be assigned.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.IndependentTag.TagOrientation
The tag orientation of the tag.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.IndependentTag.TaggedLocalElementId
The id of the tagged local element if any.

Autodesk.Revit.DB.IndependentTag.IsOrphaned
Identifies if the tag is orphaned or not.
Remarks:
Orphans are those tags that are associated with an instance of a linked Revit file but have no host element. Tags become orphaned when the element they were tagging was deleted from the link.

Autodesk.Revit.DB.IndependentTag.TaggedElementId
The LinkElementId of the tagged element.
Remarks:
If there is no tagged element because the tag is orphaned, LinkElementId.HostElementId, LinkElementId.LinkElementId and LinkElementId.LinkInstanceId will be InvalidElementId.

Autodesk.Revit.DB.IndependentTag.MultiReferenceAnnotationId
The multi-reference annotation which owns this tag.

Autodesk.Revit.DB.IndependentTag.LeaderEnd
Returns the position of the end of leader.
leaderElbow:  Assign the end of the Tag Leader.
Returns:  Return the end of the Tag Leader.
Remarks: This property retrieves the end position of Tag Leader, which tie to the Host obj.
And ONLY Material Tag support Set operation!

Autodesk.Revit.DB.IndependentTag.LeaderElbow
Returns the position of the elbow of leader.
leaderElbow:  Assign the Elbow of the Tag Leader.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If there is no leader for this tag
or the leader is straight, the InvalidOperationException will be thrown.
Returns:  Return the Elbow of the Tag Leader.
Remarks: This property retrieves the elbow position of Tag Leader.

Autodesk.Revit.DB.IndependentTag.TagHeadPosition
Returns the position of the head of tag.
tagHeadpos:  Assign the Head Position of the Tag.
Returns:  Return the Head Position of the Tag.
Remarks: This property retrieves the head position of tag head.

Autodesk.Revit.DB.IndependentTag
Represents an IndependentTag within Autodesk Revit.